In [ ]:
подключаем библитеки

In [199]:
import psycopg2
import psycopg2.extras
import sys
import pandas as pd
import numpy as np

In [ ]:
подключаемся к базе данных postgres

In [294]:
conn = psycopg2.connect(host="localhost",
                            user="postgres",
                            password="1234",
                            database="postgres")
cursor = conn.cursor()

In [ ]:
вытягиваем таблицы

In [295]:
cur.execute('Select * from operations;')
operations1 = cur.fetchall()
cur.execute('Select * from meneger;')
meneger1 = cur.fetchall()
cur.execute('Select * from adress;')
adress1 = cur.fetchall()
cur.execute('Select * from nomenklature;')
nomenklature1 = cur.fetchall()

operations = pd.DataFrame(operations1)
meneger = pd.DataFrame(meneger1)
adress = pd.DataFrame(adress1)
nomenklature = pd.DataFrame(nomenklature1)

In [ ]:
Находит самую популярную рассу

In [430]:
join_meneger=operations.merge(meneger,how='inner', left_on=2, right_on=0)
join_meneger2

         2  0_x  1_x  2_x  3_x  0_y  1_y  2_y  4  5
3_y
Дроид    7    7    7    7    7    7    7    7  7  7
Призрак  7    7    7    7    7    7    7    7  7  7
Человек  9    9    9    9    9    9    9    9  9  9

In [347]:
join_nomenklature=operations.merge(nomenklature,how='inner', left_on=1, right_on=0)

In [263]:
cur.execute('Select * from nomenklature;')

In [264]:
nomenklature1 = cur.fetchall()

In [266]:
operations = pd.DataFrame(operations1)
meneger = pd.DataFrame(meneger1)
adress = pd.DataFrame(adress1)
nomenklature = pd.DataFrame(nomenklature1)

groupby_nomenklature = join_nomenklature.groupby('1_y').aggregate(summ)

In [ ]:
Показывает самый популярный товар по обороту из втрой иерархии

In [420]:
groupby_nomenklature2 = join_nomenklature.groupby('2_y').aggregate(sum)
groupby_nomenklature2

                  3_y
2_y
Амиаак            400
Вода             1200
Вода с Лимоном   1000
Гелий             600
Жидкий водород   1600
Жидкий кислород   800
Кислород          200
Углекислый газ     30

In [329]:
Создаем запрос для просмотра какой оборот принесла каждая номенклатура товара

In [330]:
groupby_nomenklature = join_nomenklature.groupby('1_y').aggregate(sum)
groupby_nomenklature

           3_y
1_y
Газ       1230
Жидкость  4600

In [ ]:
Показывает самую популярную станцию

In [435]:
adress.groupby(1).agg(np.ma.count)

                                            0
1
Луна, станция "Вторая колыбель"             2
Марс, станция "Первый марсианин"            2
Меркурий, станция "Огонь"                   1
Плутон, станция "Далеко, зато дешево"       1
Фобос, станция "Дозаправься и лети дальше"  1

In [ ]:
получаем среднюю стоимость товара по первой иерархии

In [444]:
groupby_nomenklature2 = join_nomenklature.groupby('1_y').mean()
groupby_nomenklature2

                 3_y
1_y
Газ       102.500000
Жидкость  418.181818

In [ ]:
сохраняем запрос в csv

In [438]:
pd.DataFrame(adress.groupby(1).agg(np.ma.count)).to_csv('Saved.csv')